/*Напишите программу, которая по заданному номеру четверти,
 показывает диапазон возможных координат точек в этой четверти (x и y).*/

System.Console.WriteLine("введите число");

string quarter = Console.ReadLine();
int int_quarter = 